package com.novoda;

import org.json.JSONArray;
import org.json.JSONException;
import org.json.JSONObject;

import java.io.BufferedReader;
import java.io.IOException;
import java.io.StringReader;
import java.util.ArrayList;
import java.util.Random;

/**
 * Created by andreykazakov on 26.03.16.
 */
public class Randomizer {


    public static ArrayList<String> methodName() throws IOException, JSONException {


            String str = "{\t\n" +
                    "\t\"countries\": [\n" +
                    "\t{\n" +
                    "      \"id\": 0,\n" +
                    "      \"name\": \"Бельгия\"\n" +
                    "    },\n" +
                    "    {\n" +
                    "      \"id\": 1,\n" +
                    "      \"name\": \"Канада\"\n" +
                    "    },\n" +
                    "    {\n" +
                    "      \"id\": 2,\n" +
                    "      \"name\": \"Германия\"\n" +
                    "    },\n" +
                    "    {\n" +
                    "      \"id\": 3,\n" +
                    "      \"name\": \"Финляндия\"\n" +
                    "    },\n" +
                    "    {\n" +
                    "      \"id\": 4,\n" +
                    "      \"name\": \"Великобритания\"\n" +
                    "    },\n" +
                    "    {\n" +
                    "      \"id\": 5,\n" +
                    "      \"name\": \"Нидерланды\"\n" +
                    "    },\n" +
                    "    {\n" +
                    "      \"id\": 6,\n" +
                    "      \"name\": \"Ирландия\"\n" +
                    "    },\n" +
                    "    {\n" +
                    "      \"id\": 7,\n" +
                    "      \"name\": \"Исландия\"\n" +
                    "    },\n" +
                    "    {\n" +
                    "      \"id\": 8,\n" +
                    "      \"name\": \"Австрия\"\n" +
                    "    },\n" +
                    "    {\n" +
                    "      \"id\": 9,\n" +
                    "      \"name\": \"Италия\"\n" +
                    "    },\n" +
                    "    {\n" +
                    "      \"id\": 10,\n" +
                    "      \"name\": \"Турция\"\n" +
                    "    },\n" +
                    "    {\n" +
                    "      \"id\": 11,\n" +
                    "      \"name\": \"Чили\"\n" +
                    "    },\n" +
                    "    {\n" +
                    "      \"id\": 12,\n" +
                    "      \"name\": \"Россия\"\n" +
                    "    },\n" +
                    "    {\n" +
                    "      \"id\":13,\n" +
                    "      \"name\": \"США\"\n" +
                    "    },\n" +
                    "    {\n" +
                    "      \"id\": 14,\n" +
                    "      \"name\": \"Австралия\"\n" +
                    "    }\n" +
                    "],\n" +
                    "\t\"type\": [\n" +
                    "\t  {\n" +
                    "          \"id\": 0,\n" +
                    "          \"typeName\": \"Активный отдых\"\n" +
                    "        },\n" +
                    "\t  {\n" +
                    "\t  \"id\": 1,\n" +
                    "\t  \"typeName\": \"Здоровье\"\n" +
                    "\t},\n" +
                    "\t  {\n" +
                    "          \"id\": 2,\n" +
                    "\t  \"typeName\": \"Пляжный отдых\"\n" +
                    "\t},\n" +
                    "\t{\n" +
                    "\t  \"id\": 3,\n" +
                    "\t  \"typeName\": \"Туризм\"\n" +
                    "\t}\n" +
                    "],\n" +
                    "\t\"activities\": [\n" +
                    "\t{\n" +
                    "\t  \"actName\": \"Зимний спорт\",\n" +
                    "        \"id\": 0,\n" +
                    "\t\"typeId\": 0\n" +
                    "\t  },\n" +
                    "\t {\n" +
                    "\t  \"actName\": \"Водный спорт\",\n" +
                    "     \t  \"id\": 1,\n" +
                    "\t  \"typeId\":0\n" +
                    "\t},\n" +
                    "\t  {\n" +
                    "\t  \"actName\": \"Горячие источники\",\n" +
                    "          \"id\": 2,\n" +
                    "\t  \"typeId\": 1\n" +
                    "\t},\n" +
                    "\t  {\n" +
                    "\t  \"actName\": \"Горные походы\",\n" +
                    "          \"id\": 3,\n" +
                    "\t  \"typeId\": 1\n" +
                    "\t},\n" +
                    "\t  {\n" +
                    "\t  \"actName\": \"Купание\",\n" +
                    "          \"id\": 4,\n" +
                    "\t  \"typeId\": 2\n" +
                    "\t},\n" +
                    "\t  {\n" +
                    "\t  \"actName\": \"Пляжные развлечения\",\n" +
                    "     \t  \"id\": 5,\n" +
                    "\t  \"typeId\": 2\n" +
                    "\t},\n" +
                    "\t  {\n" +
                    "\t  \"actName\": \"Музеи\",\n" +
                    "\t  \"id\": 6,\n" +
                    "\t  \"typeId\": 3\n" +
                    "\t},\n" +
                    "\t  {\n" +
                    "\t  \"actName\": \"Исторические места\",\n" +
                    "     \t  \"id\": 7,\n" +
                    "\t  \"typeId\": 3\n" +
                    "\t},\n" +
                    "\t  {\n" +
                    "\t  \"actName\": \"Альпинизм\",\n" +
                    "     \t  \"id\": 8,\n" +
                    "\t  \"typeId\": 0\n" +
                    "\t},\n" +
                    "\t  {\n" +
                    "\t  \"actName\": \"Рафтинг\",\n" +
                    "     \t  \"id\": 9,\n" +
                    "\t  \"typeId\": 0\n" +
                    "\t},\n" +
                    "\t  {\n" +
                    "\t  \"actName\": \"Дайвинг\",\n" +
                    "     \t  \"id\": 10,\n" +
                    "\t  \"typeId\": 0\n" +
                    "\t},\n" +
                    "\t  {\n" +
                    "\t  \"actName\": \"Сафари парк\",\n" +
                    "     \t  \"id\": 11,\n" +
                    "\t  \"typeId\": 0\n" +
                    "\t},\n" +
                    "\t  {\n" +
                    "\t  \"actName\": \"СПА\",\n" +
                    "     \t  \"id\": 12,\n" +
                    "\t  \"typeId\": 1\n" +
                    "\t},\n" +
                    "\t  {\n" +
                    "\t  \"actName\": \"Специальные оздоровительные программы\",\n" +
                    "     \t  \"id\": 13,\n" +
                    "\t  \"typeId\": 1\n" +
                    "\t},\n" +
                    "\t  {\n" +
                    "\t  \"actName\": \"Экзотика\",\n" +
                    "     \t  \"id\": 14,\n" +
                    "\t  \"typeId\": 3\n" +
                    "\t},\n" +
                    "\t  {\n" +
                    "\t  \"actName\": \"Водные прогулки\",\n" +
                    "     \t  \"id\": 15,\n" +
                    "\t  \"typeId\": 2\n" +
                    "\t},\n" +
                    "\t  {\n" +
                    "\t  \"actName\": \"Национальная кухня\",\n" +
                    "     \t  \"id\": 16,\n" +
                    "\t  \"typeId\": 2\n" +
                    "\t},\n" +
                    "\t  {\n" +
                    "\t  \"actName\": \"Архитектура\",\n" +
                    "     \t  \"id\": 17,\n" +
                    "\t  \"typeId\": 3\n" +
                    "\t},\n" +
                    "\t  {\n" +
                    "\t  \"actName\": \"Велосипедные прогулки\",\n" +
                    "     \t  \"id\": 18,\n" +
                    "\t  \"typeId\": 0\n" +
                    "\t},\n" +
                    "\t  {\n" +
                    "\t  \"actName\": \"Рыбалка\",\n" +
                    "     \t  \"id\": 19,\n" +
                    "\t  \"typeId\": 0\n" +
                    "\t},\n" +
                    "\t  {\n" +
                    "\t  \"actName\": \"Пешие походы\",\n" +
                    "     \t  \"id\": 20,\n" +
                    "\t  \"typeId\": 0\n" +
                    "\t}\n" +
                    "],\n" +
                    "\t\"cities\": [\n" +
                    "    {\n" +
                    "      \"countryId\": 0,\n" +
                    "      \"id\": 0,\n" +
                    "      \"latitude\": 49.15278,\n" +
                    "      \"longitude\": -121.93889,\n" +
                    "      \"name\": \"`Чиллиуок\",\n" +
                    "      \"summer\": [3,20,19,14,18],\n" +
                    "      \"winter\": [19,20,14,3],\n" +
                    "      \"other\": [3,20,19,14,18],\n" +
                    "      \"description\": \"город в Британской Колумбии, Канада. Находится в 100км от столицы - Ванкувера. Живописный ландшафт, озера и прекрасный климат - все, что нужно для хорошего отдыха.\"\n" +
                    "    },\n" +
                    "    {\n" +
                    "      \"countryId\": 1,\n" +
                    "      \"id\": 1,\n" +
                    "      \"latitude\": 51.189445,\n" +
                    "      \"longitude\": 4.460278,\n" +
                    "      \"name\": \"Антверпен\",\n" +
                    "      \"summer\": [17,6],\n" +
                    "      \"winter\": [6,17],\n" +
                    "      \"other\": [6,17],\n" +
                    "      \"description\" : \"Город во Фламандском регионе Бельгии. Красивая архитектура, атмосфера старого города и великолепные водные прогулки.\"\n" +
                    "      \n" +
                    "    },\n" +
                    "    {\n" +
                    "      \"countryId\": 2,\n" +
                    "      \"id\": 2,\n" +
                    "      \"latitude\": 52.38,\n" +
                    "      \"longitude\": 13.5225,\n" +
                    "      \"name\": \"Берлин\",\n" +
                    "      \"summer\": [17,7,6],\n" +
                    "      \"winter\": [17,7,6],\n" +
                    "      \"other\": [17,7,6],\n" +
                    "      \"description\" : \"Столица Германии, самый крупный и самый населённый город страны. Множество музеев, соборов, а также возможность оценить местное пиво и знаменитые колбаски.\"\n" +
                    "    },\n" +
                    "    {\n" +
                    "      \"countryId\": 2,\n" +
                    "      \"id\": 346,\n" +
                    "      \"latitude\": 50.707657,\n" +
                    "      \"longitude\": 8.082969,\n" +
                    "      \"name\": \"Зигерланд\",\n" +
                    "      \"summer\": [19,20],\n" +
                    "      \"winter\": [],\n" +
                    "      \"other\": [19,20],\n" +
                    "      \"description\" : \"Прекрасное место для отдыха на природе.\"\n" +
                    "    },\n" +
                    "    {\n" +
                    "      \"countryId\": 2,\n" +
                    "      \"id\": 366,\n" +
                    "      \"latitude\": 47.671318,\n" +
                    "      \"longitude\": 9.511486,\n" +
                    "      \"name\": \"Фридрихсхафен\",\n" +
                    "      \"summer\": [17,6,15],\n" +
                    "      \"winter\": [17,6],\n" +
                    "      \"other\": [17,6,15],\n" +
                    "      \"description\" : \"Город в Германии на берегу Боденского озера. Водные экскурсии и замечательные виды - вот, что ждет вас здесь.\"\n" +
                    "    },\n" +
                    "    {\n" +
                    "      \"countryId\": 3,\n" +
                    "      \"id\": 407,\n" +
                    "      \"latitude\": 60.654446,\n" +
                    "      \"longitude\": 24.881111,\n" +
                    "      \"name\": \"Хювинкяа\",\n" +
                    "      \"summer\": [20,18,12,13],\n" +
                    "      \"winter\": [20,12,13],\n" +
                    "      \"other\": [20,18,12,13],\n" +
                    "      \"description\" : \"Город в Финляндии в 50км от Хельсинки. Прекрасное место для оздоровительного отдыха.\"\n" +
                    "    },\n" +
                    "    {\n" +
                    "      \"countryId\": 4,\n" +
                    "      \"id\": 473,\n" +
                    "      \"latitude\": 51.87472,\n" +
                    "      \"longitude\": -0.368333,\n" +
                    "      \"name\": \"Лондон\",\n" +
                    "      \"summer\": [6,7,17,16],\n" +
                    "      \"winter\": [6,7,17,16],\n" +
                    "      \"other\": [6,7,17,16],\n" +
                    "      \"description\" : \"Столица Великобритании предлагает вам различные виды отдыха от осмотра достопримечательностей до посещения местных пабов и футбольных стадионов.\"\n" +
                    "    },\n" +
                    "    {\n" +
                    "      \"countryId\": 4,\n" +
                    "      \"id\": 474,\n" +
                    "      \"latitude\": 50.42278,\n" +
                    "      \"longitude\": -4.105833,\n" +
                    "      \"name\": \"Плимут\",\n" +
                    "      \"summer\": [6,15,17],\n" +
                    "      \"winter\": [6,17],\n" +
                    "      \"other\": [6,15,17],\n" +
                    "      \"description\" : \"Город в Англии на берегу Ла-Манша. Здесь находится известный музей автомобилей.\" \n" +
                    "    },\n" +
                    "    {\n" +
                    "      \"countryId\": 5,\n" +
                    "      \"id\": 555,\n" +
                    "      \"latitude\": 52.308613,\n" +
                    "      \"longitude\": 4.763889,\n" +
                    "      \"name\": \"Амстердам\",\n" +
                    "      \"summer\": [6,14,15,16,17,18],\n" +
                    "      \"winter\": [6,14,16,17,18],\n" +
                    "      \"other\": [6,14,15,16,17,18],\n" +
                    "      \"description\" : \"Столица Нидерландов. Город возможностей и соблазнов.\"\n" +
                    "    },\n" +
                    "    {\n" +
                    "      \"countryId\": 6,\n" +
                    "      \"id\": 578,\n" +
                    "      \"latitude\": 54.280212,\n" +
                    "      \"longitude\": -8.599206,\n" +
                    "      \"name\": \"Слайго\",\n" +
                    "      \"summer\": [3,14,19,20],\n" +
                    "      \"winter\": [3,14,19,20],\n" +
                    "      \"other\": [3,14,19,20],\n" +
                    "      \"description\" : \"Местечко на востоке Ирландии. Здесь представлены все виды отдыха на природе.\"\n" +
                    "    },\n" +
                    "    {\n" +
                    "      \"countryId\": 7,\n" +
                    "      \"id\": 17,\n" +
                    "      \"latitude\": 64.13,\n" +
                    "      \"longitude\": -21.940556,\n" +
                    "      \"name\": \"Рейкьявик\",\n" +
                    "      \"summer\": [2,12,16,17,20],\n" +
                    "      \"winter\": [2,12,16,17,20],\n" +
                    "      \"other\": [2,12,16,17,20],\n" +
                    "      \"description\" : \"Столица Исландии. Знаменитые горячие источники и невероятная красота природы.\"\n" +
                    "    },\n" +
                    "    {\n" +
                    "      \"countryId\": 8,\n" +
                    "      \"id\": 1507,\n" +
                    "      \"latitude\": 47.26022,\n" +
                    "      \"longitude\": 11.343964,\n" +
                    "      \"name\": \"Инсбрук\",\n" +
                    "      \"summer\": [3,8,20,17],\n" +
                    "      \"winter\": [0,3,8,20,17],\n" +
                    "      \"other\": [0,3,8,20,17],\n" +
                    "      \"description\" : \"Австрийский горнолыжный курорт. Столица зимних олимпийских игр 1964 года.\"\n" +
                    "    },\n" +
                    "    {\n" +
                    "      \"countryId\": 9,\n" +
                    "      \"id\": 1454,\n" +
                    "      \"latitude\": 41.799362,\n" +
                    "      \"longitude\": 12.594936,\n" +
                    "      \"name\": \"Рим\",\n" +
                    "      \"summer\": [17,6,7,16],\n" +
                    "      \"winter\": [17,6,7,16],\n" +
                    "      \"other\": [17,6,7,16],\n" +
                    "      \"description\" : \"Столица Италии. С каждым новым шагом вы окунаетесь в историю великой Римской империи.\"\n" +
                    "    },\n" +
                    "    {\n" +
                    "      \"countryId\": 10,\n" +
                    "      \"id\": 1579,\n" +
                    "      \"latitude\": 36.89873,\n" +
                    "      \"longitude\": 30.80046,\n" +
                    "      \"name\": \"Анталия\",\n" +
                    "      \"summer\": [1,5,4,12,10,16],\n" +
                    "      \"winter\": [],\n" +
                    "      \"other\": [1,5,4,12,10,16],\n" +
                    "      \"description\" : \"Столица мирового пляжного отдыха.\"\n" +
                    "    },\n" +
                    "    {\n" +
                    "      \"countryId\": 11,\n" +
                    "      \"id\": 1633,\n" +
                    "      \"latitude\": 17.928982,\n" +
                    "      \"longitude\": -71.64477,\n" +
                    "      \"name\": \"Кабо Рохо\",\n" +
                    "      \"summer\": [1,4,14,10,20],\n" +
                    "      \"winter\": [1,4,14,10,20],\n" +
                    "      \"other\": [1,4,14,10,20],\n" +
                    "      \"description\" : \"Местечко на западном побережье Чили. Одно из красивейших мест на нашей планете.\"\n" +
                    "    },\n" +
                    "    {\n" +
                    "      \"countryId\": 12,\n" +
                    "      \"id\": 2703,\n" +
                    "      \"latitude\": 43.44993,\n" +
                    "      \"longitude\": 39.95659,\n" +
                    "      \"name\": \"Сочи\",\n" +
                    "      \"summer\": [1,3,5,4,10,15,18,20],\n" +
                    "      \"winter\": [0,12],\n" +
                    "      \"other\": [3,12,20],\n" +
                    "      \"description\" : \"Российская столица активного и пляжного отдыха. Горные лыжи и сноуборд - зимой, купание и пляжи - летом\"\n" +
                    "    },\n" +
                    "    {\n" +
                    "      \"countryId\": 12,\n" +
                    "      \"id\": 3222,\n" +
                    "      \"latitude\": 27.765112,\n" +
                    "      \"longitude\": -82.62697,\n" +
                    "      \"name\": \"Санкт-Петербург\",\n" +
                    "      \"summer\": [6,7,15,17],\n" +
                    "      \"winter\": [6,7,17],\n" +
                    "      \"other\": [6,7,15,17],\n" +
                    "      \"description\" : \"Один из красивейших городов России. Прогулки по реке, разводные мосты и красивейшие соборы.\"\n" +
                    "    },\n" +
                    "    {\n" +
                    "      \"countryId\": 13,\n" +
                    "      \"id\": 3264,\n" +
                    "      \"latitude\": 32.69922,\n" +
                    "      \"longitude\": -117.21531,\n" +
                    "      \"name\": \"Сан Диего\",\n" +
                    "      \"summer\": [11,17,18],\n" +
                    "      \"winter\": [11,17,18],\n" +
                    "      \"other\": [11,17,18],\n" +
                    "      \"description\" : \"Город в США. Здесь расположен один из крупнейших Сафари парков мира.\"\n" +
                    "    },\n" +
                    "    {\n" +
                    "      \"countryId\": 12,\n" +
                    "      \"id\": 2700,\n" +
                    "      \"latitude\": 44.22507,\n" +
                    "      \"longitude\": 43.08189,\n" +
                    "      \"name\": \"Минеральные воды\",\n" +
                    "      \"summer\": [9,3,8,20,19],\n" +
                    "      \"winter\": [9,3,8,20,19,0],\n" +
                    "      \"other\": [9,3,8,20,19],\n" +
                    "      \"description\" : \"Город входит в состав эколого-курортного региона Кавказа. Здесь представлены различные виды активного отдыха от рафтинга до горных лыж.\"\n" +
                    "    },\n" +
                    "    {\n" +
                    "      \"countryId\": 14,\n" +
                    "      \"id\": 5151,\n" +
                    "      \"latitude\": 47.706944,\n" +
                    "      \"longitude\": -104.1925,\n" +
                    "      \"name\": \"Сидней\",\n" +
                    "      \"summer\": [1,4,17],\n" +
                    "      \"winter\": [1,4,17],\n" +
                    "      \"other\": [1,4,17],\n" +
                    "      \"description\" : \"Крупнейший город в Австралии. Здесь можно встретить как памятники архитектуры, так и места для купания и пляжного отдыха.\"\n" +
                    "    }\n" +
                    "    \n" +
                    "]\n" +
                    "}";









        String str1 = "{\n" +
                "\t\"countries\": [\n" +
                "\t{\n" +
                "      \"id\": 0,\n" +
                "      \"name\": \"Бельгия\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"id\": 1,\n" +
                "      \"name\": \"Канада\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"id\": 2,\n" +
                "      \"name\": \"Германия\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"id\": 3,\n" +
                "      \"name\": \"Финляндия\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"id\": 4,\n" +
                "      \"name\": \"Великобритания\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"id\": 5,\n" +
                "      \"name\": \"Нидерланды\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"id\": 6,\n" +
                "      \"name\": \"Ирландия\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"id\": 7,\n" +
                "      \"name\": \"Исландия\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"id\": 8,\n" +
                "      \"name\": \"Австрия\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"id\": 9,\n" +
                "      \"name\": \"Италия\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"id\": 10,\n" +
                "      \"name\": \"Турция\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"id\": 11,\n" +
                "      \"name\": \"Чили\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"id\": 12,\n" +
                "      \"name\": \"Россия\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"id\":13,\n" +
                "      \"name\": \"США\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"id\": 14,\n" +
                "      \"name\": \"Австралия\"\n" +
                "    }\n" +
                "],\n" +
                "\t\"type\": [\n" +
                "\t  {\n" +
                "          \"id\": 0,\n" +
                "          \"typeName\": \"Активный отдых\"\n" +
                "        },\n" +
                "\t  {\n" +
                "\t  \"id\": 1,\n" +
                "\t  \"typeName\": \"Здоровье\"\n" +
                "\t},\n" +
                "\t  {\n" +
                "          \"id\": 2,\n" +
                "\t  \"typeName\": \"Пляжный отдых\"\n" +
                "\t},\n" +
                "\t{\n" +
                "\t  \"id\": 3,\n" +
                "\t  \"typeName\": \"Туризм\"\n" +
                "\t}\n" +
                "],\n" +
                "\t\"activities\": [\n" +
                "\t{\n" +
                "\t  \"actName\": \"Зимний спорт\",\n" +
                "        \"id\": 0,\n" +
                "\t\"typeId\": 0,\n" +
                "      \"seasonId\":0\n" +
                "\t  },\n" +
                "\t {\n" +
                "\t  \"actName\": \"Водный спорт\",\n" +
                "     \t  \"id\": 1,\n" +
                "\t  \"typeId\":0,\n" +
                "       \"seasonId\":1\n" +
                "\t},\n" +
                "\t  {\n" +
                "\t  \"actName\": \"Горячие источники\",\n" +
                "          \"id\": 2,\n" +
                "\t  \"typeId\": 1\n" +
                "\t},\n" +
                "\t  {\n" +
                "\t  \"actName\": \"Горные походы\",\n" +
                "          \"id\": 3,\n" +
                "\t  \"typeId\": 1\n" +
                "\t},\n" +
                "\t  {\n" +
                "\t  \"actName\": \"Купание\",\n" +
                "          \"id\": 4,\n" +
                "\t  \"typeId\": 2,\n" +
                "\t},\n" +
                "\t  {\n" +
                "\t  \"actName\": \"Пляжные развлечения\",\n" +
                "     \t  \"id\": 5,\n" +
                "\t  \"typeId\": 2\n" +
                "\t},\n" +
                "\t  {\n" +
                "\t  \"actName\": \"Музеи\",\n" +
                "\t  \"id\": 6,\n" +
                "\t  \"typeId\": 3\n" +
                "\t},\n" +
                "\t  {\n" +
                "\t  \"actName\": \"Исторические места\",\n" +
                "     \t  \"id\": 7,\n" +
                "\t  \"typeId\": 3\n" +
                "\t},\n" +
                "\t  {\n" +
                "\t  \"actName\": \"Альпинизм\",\n" +
                "     \t  \"id\": 8,\n" +
                "\t  \"typeId\": 0\n" +
                "\t},\n" +
                "\t  {\n" +
                "\t  \"actName\": \"Рафтинг\",\n" +
                "     \t  \"id\": 9,\n" +
                "\t  \"typeId\": 0\n" +
                "\t},\n" +
                "\t  {\n" +
                "\t  \"actName\": \"Дайвинг\",\n" +
                "     \t  \"id\": 10,\n" +
                "\t  \"typeId\": 0\n" +
                "\t},\n" +
                "\t  {\n" +
                "\t  \"actName\": \"Сафари парк\",\n" +
                "     \t  \"id\": 11,\n" +
                "\t  \"typeId\": 0\n" +
                "\t},\n" +
                "\t  {\n" +
                "\t  \"actName\": \"СПА\",\n" +
                "     \t  \"id\": 12,\n" +
                "\t  \"typeId\": 1\n" +
                "\t},\n" +
                "\t  {\n" +
                "\t  \"actName\": \"Специальные оздоровительные программы\",\n" +
                "     \t  \"id\": 13,\n" +
                "\t  \"typeId\": 1\n" +
                "\t},\n" +
                "\t  {\n" +
                "\t  \"actName\": \"Экзотика\",\n" +
                "     \t  \"id\": 14,\n" +
                "\t  \"typeId\": 3\n" +
                "\t},\n" +
                "\t  {\n" +
                "\t  \"actName\": \"Водные прогулки\",\n" +
                "     \t  \"id\": 15,\n" +
                "\t  \"typeId\": 2\n" +
                "\t},\n" +
                "\t  {\n" +
                "\t  \"actName\": \"Национальная кухня\",\n" +
                "     \t  \"id\": 16,\n" +
                "\t  \"typeId\": 2\n" +
                "\t},\n" +
                "\t  {\n" +
                "\t  \"actName\": \"Архитектура\",\n" +
                "     \t  \"id\": 17,\n" +
                "\t  \"typeId\": 3\n" +
                "\t},\n" +
                "\t  {\n" +
                "\t  \"actName\": \"Велосипедные прогулки\",\n" +
                "     \t  \"id\": 18,\n" +
                "\t  \"typeId\": 0\n" +
                "\t},\n" +
                "\t  {\n" +
                "\t  \"actName\": \"Рыбалка\",\n" +
                "     \t  \"id\": 19,\n" +
                "\t  \"typeId\": 0\n" +
                "\t},\n" +
                "\t  {\n" +
                "\t  \"actName\": \"Пешие походы\",\n" +
                "     \t  \"id\": 20,\n" +
                "\t  \"typeId\": 0\n" +
                "\t}\n" +
                "\n" +
                "],\n" +
                "\t\"cities\": [\n" +
                "    {\n" +
                "      \"countryId\": 0,\n" +
                "      \"id\": 0,\n" +
                "      \"latitude\": 49.15278,\n" +
                "      \"longitude\": -121.93889,\n" +
                "      \"name\": \"`Чиллиуок\",\n" +
                "      \"summer\": [3,20,19,14,18],\n" +
                "      \"winter\": [19,20,14,3],\n" +
                "      \"other\": [3,20,19,14,18],\n" +
                "      \"description\": \"город в Британской Колумбии, Канада. Находится в 100км от столицы - Ванкувера. Живописный ландшафт, озера и прекрасный климат - все, что нужно для хорошего отдыха.\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"countryId\": 1,\n" +
                "      \"id\": 1,\n" +
                "      \"latitude\": 51.189445,\n" +
                "      \"longitude\": 4.460278,\n" +
                "      \"name\": \"Антверпен\",\n" +
                "      \"summer\": [17,6],\n" +
                "      \"winter\": [6,17],\n" +
                "      \"other\": [6,17],\n" +
                "      \"description\" : \"Город во Фламандском регионе Бельгии. Красивая архитектура, атмосфера старого города и великолепные водные прогулки.\"\n" +
                "      \n" +
                "    },\n" +
                "    {\n" +
                "      \"countryId\": 2,\n" +
                "      \"id\": 2,\n" +
                "      \"latitude\": 52.38,\n" +
                "      \"longitude\": 13.5225,\n" +
                "      \"name\": \"Берлин\",\n" +
                "      \"summer\": [17,7,6],\n" +
                "      \"winter\": [17,7,6],\n" +
                "      \"other\": [17,7,6],\n" +
                "      \"description\" : \"Столица Германии, самый крупный и самый населённый город страны. Множество музеев, соборов, а также возможность оценить местное пиво и знаменитые колбаски.\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"countryId\": 2,\n" +
                "      \"id\": 346,\n" +
                "      \"latitude\": 50.707657,\n" +
                "      \"longitude\": 8.082969,\n" +
                "      \"name\": \"Зигерланд\",\n" +
                "      \"summer\": [19,20],\n" +
                "      \"winter\": [],\n" +
                "      \"other\": [19,20],\n" +
                "      \"description\" : \"Прекрасное место для отдыха на природе.\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"countryId\": 2,\n" +
                "      \"id\": 366,\n" +
                "      \"latitude\": 47.671318,\n" +
                "      \"longitude\": 9.511486,\n" +
                "      \"name\": \"Фридрихсхафен\",\n" +
                "      \"summer\": [17,6,15],\n" +
                "      \"winter\": [17,6],\n" +
                "      \"other\": [17,6,15],\n" +
                "      \"description\" : \"Город в Германии на берегу Боденского озера. Водные экскурсии и замечательные виды - вот, что ждет вас здесь.\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"countryId\": 3,\n" +
                "      \"id\": 407,\n" +
                "      \"latitude\": 60.654446,\n" +
                "      \"longitude\": 24.881111,\n" +
                "      \"name\": \"Хювинкяа\",\n" +
                "      \"summer\": [20,18,12,13],\n" +
                "      \"winter\": [20,12,13],\n" +
                "      \"other\": [20,18,12,13],\n" +
                "      \"description\" : \"Город в Финляндии в 50км от Хельсинки. Прекрасное место для оздоровительного отдыха.\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"countryId\": 4,\n" +
                "      \"id\": 473,\n" +
                "      \"latitude\": 51.87472,\n" +
                "      \"longitude\": -0.368333,\n" +
                "      \"name\": \"Лондон\",\n" +
                "      \"summer\": [6,7,17,16],\n" +
                "      \"winter\": [6,7,17,16],\n" +
                "      \"other\": [6,7,17,16],\n" +
                "      \"description\" : \"Столица Великобритании предлагает вам различные виды отдыха от осмотра достопримечательностей до посещения местных пабов и футбольных стадионов.\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"countryId\": 4,\n" +
                "      \"id\": 474,\n" +
                "      \"latitude\": 50.42278,\n" +
                "      \"longitude\": -4.105833,\n" +
                "      \"name\": \"Плимут\",\n" +
                "      \"summer\": [6,15,17],\n" +
                "      \"winter\": [6,17],\n" +
                "      \"other\": [6,15,17],\n" +
                "      \"description\" : \"Город в Англии на берегу Ла-Манша. Здесь находится известный музей автомобилей.\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"countryId\": 5,\n" +
                "      \"id\": 555,\n" +
                "      \"latitude\": 52.308613,\n" +
                "      \"longitude\": 4.763889,\n" +
                "      \"name\": \"Амстердам\",\n" +
                "      \"summer\": [6,14,15,16,17,18],\n" +
                "      \"winter\": [6,14,16,17,18],\n" +
                "      \"other\": [6,14,15,16,17,18],\n" +
                "      \"description\" : \"Столица Нидерландов. Город возможностей и соблазнов.\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"countryId\": 6,\n" +
                "      \"id\": 578,\n" +
                "      \"latitude\": 54.280212,\n" +
                "      \"longitude\": -8.599206,\n" +
                "      \"name\": \"Слайго\",\n" +
                "      \"summer\": [3,14,19,20],\n" +
                "      \"winter\": [3,14,19,20],\n" +
                "      \"other\": [3,14,19,20],\n" +
                "      \"description\" : \"Местечко на востоке Ирландии. Здесь представлены все виды отдыха на природе.\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"countryId\": 7,\n" +
                "      \"id\": 17,\n" +
                "      \"latitude\": 64.13,\n" +
                "      \"longitude\": -21.940556,\n" +
                "      \"name\": \"Рейкьявик\",\n" +
                "      \"summer\": [2,12,16,17,20],\n" +
                "      \"winter\": [2,12,16,17,20],\n" +
                "      \"other\": [2,12,16,17,20],\n" +
                "      \"description\" : \"Столица Исландии. Знаменитые горячие источники и невероятная красота природы.\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"countryId\": 8,\n" +
                "      \"id\": 1507,\n" +
                "      \"latitude\": 47.26022,\n" +
                "      \"longitude\": 11.343964,\n" +
                "      \"name\": \"Инсбрук\",\n" +
                "      \"summer\": [3,8,20,17],\n" +
                "      \"winter\": [0,3,8,20,17],\n" +
                "      \"other\": [0,3,8,20,17],\n" +
                "      \"description\" : \"Австрийский горнолыжный курорт. Столица зимних олимпийских игр 1964 года.\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"countryId\": 9,\n" +
                "      \"id\": 1454,\n" +
                "      \"latitude\": 41.799362,\n" +
                "      \"longitude\": 12.594936,\n" +
                "      \"name\": \"Рим\",\n" +
                "      \"summer\": [17,6,7,16],\n" +
                "      \"winter\": [17,6,7,16],\n" +
                "      \"other\": [17,6,7,16],\n" +
                "      \"description\" : \"Столица Италии. С каждым новым шагом вы окунаетесь в историю великой Римской империи.\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"countryId\": 10,\n" +
                "      \"id\": 1579,\n" +
                "      \"latitude\": 36.89873,\n" +
                "      \"longitude\": 30.80046,\n" +
                "      \"name\": \"Анталия\",\n" +
                "      \"summer\": [1,5,4,12,10,16],\n" +
                "      \"winter\": [],\n" +
                "      \"other\": [1,5,4,12,10,16],\n" +
                "      \"description\" : \"Столица мирового пляжного отдыха.\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"countryId\": 11,\n" +
                "      \"id\": 1633,\n" +
                "      \"latitude\": 17.928982,\n" +
                "      \"longitude\": -71.64477,\n" +
                "      \"name\": \"Кабо Рохо\",\n" +
                "      \"summer\": [1,4,14,10,20],\n" +
                "      \"winter\": [1,4,14,10,20],\n" +
                "      \"other\": [1,4,14,10,20],\n" +
                "      \"description\" : \"Местечко на западном побережье Чили. Одно из красивейших мест на нашей планете.\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"countryId\": 12,\n" +
                "      \"id\": 2703,\n" +
                "      \"latitude\": 43.44993,\n" +
                "      \"longitude\": 39.95659,\n" +
                "      \"name\": \"Сочи\",\n" +
                "      \"summer\": [1,3,5,4,10,15,18,20],\n" +
                "      \"winter\": [0,12],\n" +
                "      \"other\": [3,12,20],\n" +
                "      \"description\" : \"Российская столица активного и пляжного отдыха. Горные лыжи и сноуборд - зимой, купание и пляжи - летом\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"countryId\": 12,\n" +
                "      \"id\": 3222,\n" +
                "      \"latitude\": 27.765112,\n" +
                "      \"longitude\": -82.62697,\n" +
                "      \"name\": \"Санкт-Петербург\",\n" +
                "      \"summer\": [6,7,15,17],\n" +
                "      \"winter\": [6,7,17],\n" +
                "      \"other\": [6,7,15,17],\n" +
                "      \"description\" : \"Один из красивейших городов России. Прогулки по реке, разводные мосты и красивейшие соборы.\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"countryId\": 13,\n" +
                "      \"id\": 3264,\n" +
                "      \"latitude\": 32.69922,\n" +
                "      \"longitude\": -117.21531,\n" +
                "      \"name\": \"Сан Диего\",\n" +
                "      \"summer\": [11,17,18],\n" +
                "      \"winter\": [11,17,18],\n" +
                "      \"other\": [11,17,18],\n" +
                "      \"description\" : \"Город в США. Здесь расположен один из крупнейших Сафари парков мира.\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"countryId\": 12,\n" +
                "      \"id\": 2700,\n" +
                "      \"latitude\": 44.22507,\n" +
                "      \"longitude\": 43.08189,\n" +
                "      \"name\": \"Минеральные воды\",\n" +
                "      \"summer\": [9,3,8,20,19],\n" +
                "      \"winter\": [9,3,8,20,19,0],\n" +
                "      \"other\": [9,3,8,20,19],\n" +
                "      \"description\" : \"Город входит в состав эколого-курортного региона Кавказа. Здесь представлены различные виды активного отдыха от рафтинга до горных лыж.\"\n" +
                "    },\n" +
                "    {\n" +
                "      \"countryId\": 14,\n" +
                "      \"id\": 5151,\n" +
                "      \"latitude\": 47.706944,\n" +
                "      \"longitude\": -104.1925,\n" +
                "      \"name\": \"Сидней\",\n" +
                "      \"summer\": [1,4,17],\n" +
                "      \"winter\": [1,4,17],\n" +
                "      \"other\": [1,4,17],\n" +
                "      \"description\" : \"Крупнейший город в Австралии. Здесь можно встретить как памятники архитектуры, так и места для купания и пляжного отдыха.\"\n" +
                "    }\n" +
                "    \n" +
                "]\n" +
                "}\n";
// String sCurrentLine = ""type: ["";
        BufferedReader br = null;
        String test1 = ("\t\"type\": [");
        String test2 = ("],");
        int k = 0;
        int i = 0;
        String cutoff = "";
        String cutoff1 = "";

        String idtype = (" \"id\": ");
//l-random number
        int min = 0;
        int max = 3;
        Random r = new Random();
        int l = r.nextInt((max - min) + 1) + min;
        String test3 = idtype + l + ",";

        String cutoffrandomname = "";
        String cutoffrandom = "";
        String typename = "";

        String test4 = ("\t\"activities\": [");
        int p = 0;
        int o = 0;
        String cutoffactivities = "";
        String scobeopen = "{";
        String scobeclose = "},";
        String cutoffactivitiesname = "";
        String activitiesname = "";
        int activitiestypeid = 0;
        int lines = 0;
        int x = 0;
        int count = 0;
        ArrayList<String> activitiesnamearr = new ArrayList<>();
        ArrayList<Integer> activitiesidarr = new ArrayList<>();
        int activitiesid = 0;
        String nameofactivities = "";

        String test5 = ("\t\"cities\": [");
        int y = 0;
        int t = 0;
        String cutoffcities = "";
        int f = 0;
        String cutoffcitiesname = "";
        ArrayList<String> citiesidsummernormal = new ArrayList<>();
        ArrayList<String> citiesidwinternormal = new ArrayList<>();
        ArrayList<String> citiesidothernormal = new ArrayList<>();
        int randarrid = 0;
        String citynamesum = "";
        String citynamewin = "";
        String citynameoth = "";
        String citydescsum = "";
        String citydescwin = "";
        String citydescoth = "";
        String citynamefinal = "";
        String citydescfinal = "";
        int citycountryidsum = 0;
        int citycountryidwin = 0;
        int citycountryidoth = 0;
        int citycountryidfinal = 0;
        int jk1 = 0;
        int jk2 = 0;
        int jk3 = 0;

        String test6 = ("\t\"countries\": [");
        int u = 0;
        int d = 0;
        String cutoffcountries = "";
        int w = 0;
        String cutoffcountriesname = "";
        int countriesid = 0;
        String countriesname = "";
        String countriesnamefinal = "";


        ArrayList<String> listfinal = new ArrayList<>();


        try {

            String sCurrentLine;
// br = new BufferedReader(new FileReader("C:\\test2.json"));

         //   FileInputStream fis = new FileInputStream("C:\\test3.json");
        //    br = new BufferedReader(new InputStreamReader(fis, "UTF-8"));

            BufferedReader reader7 = new BufferedReader(new StringReader(str));
            //while ((sCurrentLine = br.readLine()) != null) {
            while ((str = reader7.readLine()) != null) {
// System.out.println(sCurrentLine);

//type
                if (str.equals(test1)) {

                    k++;

                }

                if (k == 1) {
                    cutoff = cutoff + str + "\n";

                    if (str.equals(test2)) {
                        k++;

                    }
                }

//activities
                if (str.equals(test4)) {

                    p++;

                }

                if (p == 1) {
                    cutoffactivities = cutoffactivities + str + "\n";

                    if (str.equals(test2)) {
                        p++;

                    }
                }

//cities
                if (str.equals(test5)) {
                    y++;
                }

                if (y == 1) {
                    cutoffcities = cutoffcities + str + "\n";

                    if (str.equals(test2)) {
                        y++;

                    }
                }

//countries
                if (str.equals(test6)) {
                    u++;
                }

                if (u == 1) {
                    cutoffcountries = cutoffcountries + str + "\n";

                    if (str.equals(test2)) {
                        u++;

                    }
                }

            }

//type
            BufferedReader reader = new BufferedReader(new StringReader(cutoff));

            while ((cutoff = reader.readLine()) != null) {

                if (i == 1) {
                    i--;
                    cutoffrandomname = cutoffrandomname + cutoff + "\n";
                    cutoffrandom = "{" + "\n" + test3 + "\n" + cutoffrandomname + "\n" + "}";

                    JSONObject obj = new JSONObject(cutoffrandom);
                    typename = obj.getString("typeName");
                }

                if (cutoff.trim().equals(test3.trim())) {
                    i++;
                }

            }

//activities
            BufferedReader reader2 = new BufferedReader(new StringReader(cutoffactivities));
            BufferedReader reader3 = new BufferedReader(new StringReader(cutoffactivitiesname));

            while ((cutoffactivities = reader2.readLine()) != null) {

                if (o == 1) {

                    x++;
                    cutoffactivitiesname = cutoffactivitiesname + cutoffactivities + "\n";

                    if (x == 4) {
                        cutoffactivitiesname = "{" + cutoffactivitiesname;
                        JSONObject obj1 = new JSONObject(cutoffactivitiesname);
                        activitiestypeid = obj1.getInt("typeId");
                        if (activitiestypeid == l) {
                            count++;
                            activitiesname = obj1.getString("actName");
                            activitiesid = obj1.getInt("id");
                            activitiesnamearr.add(activitiesname);
                            activitiesidarr.add(activitiesid);
                        }

                    }

                }

                if (cutoffactivities.trim().equals(scobeopen.trim())) {
                    o++;
                    cutoffactivitiesname = "";
                    x = 0;
                }

                if (cutoffactivities.trim().equals(scobeclose.trim())) {
                    o--;
                }

            }

            int length = activitiesidarr.size();

            for (int rt = 0; rt < length; rt++) {
                int rand = (int) (Math.random() * length);

                randarrid = activitiesidarr.get(rand);

//randarrid - randomnoe chislo iz spiska activitiesidarr

                nameofactivities = activitiesnamearr.get(rand);

            }

//cities
            BufferedReader reader4 = new BufferedReader(new StringReader(cutoffcities));

            while ((cutoffcities = reader4.readLine()) != null) {

                if (t == 1) {
                    f++;
                    cutoffcitiesname = cutoffcitiesname + cutoffcities + "\n";
                    if (f == 10) {
                        cutoffcitiesname = "{" + cutoffcitiesname + "},";
                        JSONObject obj2 = new JSONObject(cutoffcitiesname);

                        JSONArray su = obj2.getJSONArray("summer");
                        ArrayList<Integer> summer = new ArrayList<>();
                        for (int g = 0; g < su.length(); g++)
                            summer.add(su.getInt(g));

                        JSONArray win = obj2.getJSONArray("winter");
                        ArrayList<Integer> winter = new ArrayList<>();
                        for (int kl = 0; kl < win.length(); kl++)
                            winter.add(win.getInt(kl));

                        JSONArray oth = obj2.getJSONArray("other");
                        ArrayList<Integer> other = new ArrayList<>();
                        for (int rt = 0; rt < oth.length(); rt++)
                            other.add(oth.getInt(rt));

                        int lengthsu = summer.size();
                        int lengthwin = winter.size();
                        int lengthoth = other.size();

                        for (int rt1 = 0; rt1 < lengthsu; rt1++) {

                            if (randarrid == summer.get(rt1)) {

                                JSONObject obj4 = new JSONObject(cutoffcitiesname);
                                citynamesum = obj4.getString("name");
                                citydescsum = obj4.getString("description");
                                citycountryidsum = obj4.getInt("countryId");
                            }

                        }

                        for (int rt2 = 0; rt2 < lengthwin; rt2++) {

                            if (randarrid == winter.get(rt2)) {

                                JSONObject obj5 = new JSONObject(cutoffcitiesname);
                                citynamewin = obj5.getString("name");
                                citydescwin = obj5.getString("description");
                                citycountryidwin = obj5.getInt("countryId");
                            }

                        }

                        for (int rt3 = 0; rt3 < lengthoth; rt3++) {

                            if (randarrid == other.get(rt3)) {

                                JSONObject obj6 = new JSONObject(cutoffcitiesname);
                                citynameoth = obj6.getString("name");
                                citydescoth = obj6.getString("description");
                                citycountryidoth = obj6.getInt("countryId");
                            }

                        }

                    }

                }

                if (cutoffcities.trim().equals(scobeopen.trim())) {
                    t++;
                    cutoffcitiesname = "";
                    f = 0;
                }

                if (cutoffcities.trim().equals(scobeclose.trim())) {
                    t--;
                }

            }

            if (citynamesum != "") {
                jk1++;
                if (jk1 == 1) {
                    citynamefinal = citynamesum;
                    citydescfinal = citydescsum;
                    citycountryidfinal = citycountryidsum;
                }

            }

            if (citynamewin != "") {
                jk2++;
                if (jk2 == 1) {
                    citynamefinal = citynamewin;
                    citydescfinal = citydescwin;
                    citycountryidfinal = citycountryidwin;
                }

            }

            if (citynameoth != "") {
                jk3++;
                if (jk3 == 1) {
                    citynamefinal = citynameoth;
                    citydescfinal = citydescoth;
                    citycountryidfinal = citycountryidoth;
                }

            }

//countries
            BufferedReader reader5 = new BufferedReader(new StringReader(cutoffcountries));

            while ((cutoffcountries = reader5.readLine()) != null) {

                if (d == 1) {
                    w++;
                    cutoffcountriesname = cutoffcountriesname + cutoffcountries + "\n";
                    if (w == 3) {
                        cutoffcountriesname = "{" + cutoffcountriesname;
                        JSONObject obj7 = new JSONObject(cutoffcountriesname);
                        countriesid = obj7.getInt("id");
                        countriesname = obj7.getString("name");
                        if (countriesid == citycountryidfinal) {
                            countriesnamefinal = countriesname;
                        }

                    }
                }

                if (cutoffcountries.trim().equals(scobeopen.trim())) {
                    d++;
                    cutoffcountriesname = "";
                    w = 0;
                }

                if (cutoffcountries.trim().equals(scobeclose.trim())) {
                    d--;
                }

            }


            String entertaiments = "";

            int length2 = activitiesidarr.size();
            // System.out.print("–азвлечени€: ");
            for (int rt6 = 0; rt6 < length; rt6++) {

                entertaiments = entertaiments + (activitiesnamearr.get(rt6) + " ");
                //    System.out.print(activitiesnamearr.get(rt6) + ", ");

            }

            listfinal.add(entertaiments);

            //    System.out.println("\n" + "—трана: " + countriesnamefinal + "\n" + "√ород: " + citynamefinal + "\n" + "ќписание: " + citydescfinal);

            listfinal.add(countriesnamefinal);
            listfinal.add(citynamefinal);
            listfinal.add(citydescfinal);


        } catch (IOException e) {
            e.printStackTrace();
        } finally {
            try {
                if (br != null) br.close();
            } catch (IOException ex) {
                ex.printStackTrace();
            }
        }





        return listfinal;
    }





}
